Repository: mapsplugin/cordova-plugin-googlemaps
Catalog: src/ios/strings/*.lproj/pgm_Localizable.strings
Languages: ar, fr, hi

# CLOSE_BUTTON
source: CLOSE
ar: أغلق
fr: FERMER
hi: बंद

# APIKEY_IS_UNDEFINED_TITLE
source: API key error
ar: خطأ مفتاح API
fr: Erreur liée à la clé API
hi: एपीआई कुंजी त्रुटि

# APIKEY_IS_UNDEFINED_MESSAGE
source: The variable 'API_KEY_FOR_IOS' is not registered.
ar: لم يتم تسجيل المتغير API_KEY_FOR_IOS
fr: Variable "API_KEY_FOR_IOS" non enregistrée.
hi: चर API_KEY_FOR_IOS पंजीकृत (रजिस्टर) नहीं हुआ.

# APP_NAME_ERROR_TITLE
source: You need to change the config.xml file
ar: يجب عليك تغيير ملف config.xml
fr: Vous devez modifier le fichier config.xml
hi: आपको config.xml फ़ाइल को बदलना होगा

# APP_NAME_ERROR_MESSAGE
source: Google Maps SDK for iOS crashes if CFBundleExecutable contains non-English characters. More details, Check out the comment in the CordovaGoogleMaps.m file.
ar: CordovaGoogleMaps.m لمزيد من المعلومات ، انظر التعليق في . عندما تكون الأحرف غير الإنجليزية قيد الاستخدام Google Maps SDK في CFBundleExecutable في حالة تعطل
fr: Google Maps SDK pour iOS crash si CFBundleExecutable contient des caractères non-Anglais. Pour plus de détails, veuillez consulter le commentaire dans le fichier CordovaGoogleMaps.m.
hi: अगर CFBundleExecutable मे गैर-अंग्रेज़ी वर्णों होने पर गूगल मैप्स एसडीके (Google Maps SDK) क्रैश हो जाता है. और जानकारी के लिए CordovaGoogleMaps.m मे टिप्पणी को देखें.

# LOCATION_IS_UNAVAILABLE_ERROR_TITLE
source: Location Service is not available
ar: خدمة الموقع غير متوفرة
fr: Service de localisation non disponible
hi: स्थान सेवा उपलब्ध नहीं है

# LOCATION_IS_UNAVAILABLE_ERROR_MESSAGE
source: This app needs to access your location. Please turn on 'Settings > Privacy > Location Services'
ar: Settings> Privacy> Location Services يحتاج هذا التطبيق إلى موقعك. يرجى تشغيل
fr: Cette application nécessite un accès à votre localisation. Veuillez activer le service de localisation dans "Réglages > Confidentialité > Service de localisation"
hi: इस एप को आप के स्थान की ज़रुरत है. कृपया Settings > Privacy > Location Services से चालू करें

# LOCATION_IS_DENIED_MESSAGE
source: This app has rejected to use Location Services.
ar: . رفض هذا التطبيق استخدام خدمة الموقع
fr: Cette application a rejeté le service de localisation.
hi: इस एप ने स्थान सेवा को उपयोग करना अस्वीकार कर दिया है.

# CAN_NOT_GET_LOCATION_MESSAGE
source: Cannot get your location.
ar: . موقعك غير متاح
fr: Votre localisation est introuvable.
hi: आपका स्थान उपलब्ध नही है.

# LOCATION_REJECTED_BY_USER_MESSAGE
source: Location service is rejected by user.
ar: . رفض المستخدم خدمة الموقع
fr: Le service de localisation a été rejeté par cet utilisateur.
hi: उपयोगकर्ता ने स्थान सेवा अस्वीकार कर दिया है.
